---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRotation
source: html/4c2d7e67-a5fe-52a3-d6c8-1e47b507725d.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRotation Property

The property labeled "Rotation" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.